Revit 2024 API
ComponentClassification Enumeration
 An enumerated type lists all MEP component classification. This attribute describes the general purpose of the MEP part component, that is used for scheduling, tagging, filter, ODBC, and etc. One component classification may include more than one part type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ComponentClassification
Visual Basic
Public Enumeration ComponentClassification
Visual C++
public enum class ComponentClassification
Members
Member name | Description
Undefined |  Undefined component classification
Pipe |  Straight pipe segment component classification
Duct |  Straight duct segment component classification
FlexPipe |  Flex pipe curve component classification
FlexDuct |  Flex duct curve component classification
Elbow |  Elbow component classification
Tee |  Tee component classification
Tap |  Cap component classification
Transition |  Transition component classification
Cross |  Cross component classification
Endcap |  Cap component classification
Coupling |  Coupling component classification
Union |  Union component classification
Flange |  Flange component classification
Wye |  Wye component classification
Valve |  Valve component classification
Sensor |  Sensor component classification
Hanger |  Hanger (supports) component classification
Sleeve |  Sleeve (supports) component classification
See Also
Autodesk.Revit.DB.Mechanical Namespace